Repository: shimsw20/theorem_proving_in_lean4
Catalog: locale/kr/kr-level2.tmx
Source language: en_us
Languages: ko

source: You will learn various methods to support this in dependent type theory.
ko: 여러분은 의존 유형론에서 이를 지원하는 다양한 방법에 대해 배웁니다.

source: You will see in Chapter Inductive Types that these tactics are quite general.
ko: 귀납형 장에서 이 전략들은 꽤나 일반적임을 볼 것입니다.

source: You will see later how these terms are evaluated.
ko: 여러분은 나중에 이 항들이 어떻게 평가되는지 볼 겁니다.

source: apply And.intro <;> triv -- We now add a (recursive) extension macro_rules | `(tactic| triv) => `(tactic| apply And.intro <;> triv) example (x : α) (h : p) : x = x ∧ p := by
ko: apply And.intro <;> triv -- 이제 우리는 (재귀적인) 확장을 추가합니다. macro_rules | `(tactic| triv) => `(tactic| apply And.intro <;> triv) example (x : α) (h : p) : x = x ∧ p := by

source: creates aliases for succ, add, and sub in the current namespace, so that whenever the namespace is open, these aliases are available.
ko: 이 이름공간이 열리기만 하면 별명을 이용할 수 있도록 현재 이름공간에 succ과 add과 sub에 대한 별명을 만듭니다.

source: creates aliases for everything in the Nat namespace except the identifiers listed.
ko: 나열된 식별자를 제외한 Nat 이름공간 속 모든 것에 대한 별명을 만듭니다.

source: creates aliases for only the identifiers listed.
ko: 나열된 식별자들만을 위한 별명을 만드세요.

source: creates aliases renaming Nat.mul to times and Nat.add to plus.
ko: Nat.mul을 times 으로 그리고 Nat.add을 plus로 다시 이름지어 별명을 만드세요.

source: error: tactic 'rewrite' failed, did not find instance of the pattern
ko: 오류: '다시 쓰기' 전술이 실패했습니다. 패턴의 개체를 찾지 못했습니다.(error: tactic 'rewrite' failed, did not find instance of the pattern)

source: fun x => id1 x -- In this example, implicit lambda introduction has been disabled -- because we used the binder annotation `{...}` def id5 : {α : Type} → α → α :=
ko: fun x => id1 x -- 이 예제에서 암시적인 람다의 도입은 결합 주석 `{...}`을 -- 사용했기 때문에 해제되었습니다. def id5 : {α : Type} → α → α :=

source: imports the file Bar/Baz/Blah.olean, where the descriptions are interpreted relative to the Lean search path.
ko: 린의 파일 search path에 상대적인 주소로 설명된 곳에서 Bar/Baz/Blah.olean을 불러옵니다.

source: in the target expression
ko: 대상 표현식에서

source: is treated as a macro, and expands to
ko: 은 매크로로 간주되고

source: mdbook watch --open # opens the output in `out/` in your default browser
ko: mdbook watch을 열고 # 여러분의 기본 브라우저에서 `out/`에서 출력을 여세요.

source: mutually recursive definitions
ko: 상호적으로 재귀적인 정의

source: nested_and_mutual_recursion:
ko: 중접되고 상호적인 재귀

source: notation "‹" p "›" => show p by assumption
ko: 기호 "‹" p "›" => 은 가정에 의해 p가 참임을 보입니다.

source: open Classical -- distributivity example (p q r : Prop) : p ∧ (q ∨ r) ↔ (p ∧ q) ∨ (p ∧ r) :=
ko: open Classical -- 분배성 example (p q r : Prop) : p ∧ (q ∨ r) ↔ (p ∧ q) ∨ (p ∧ r) :=

source: or just
ko: 아니면 그냥

source: show p ∧ (q ∨ r) from ⟨hp, Or.inr hr⟩)) -- an example that requires classical reasoning example (p q : Prop) : ¬(p ∧ ¬q) → (p → q) :=
ko: show p ∧ (q ∨ r) from ⟨hp, Or.inr hr⟩)) -- 고전 추론을 필요로 하는 예제 example (p q : Prop) : ¬(p ∧ ¬q) → (p → q) :=

source: structurally recursive definitions
ko: 구조적으로 재귀적인 정의

source: triv -- You cannot prove the following theorem using `triv` -- example (x : α) : x = x := by -- triv -- Let's extend `triv`.
ko: triv -- 여러분은 `triv` 사용해 다음 정리를 증명할 수 없습니다. -- example (x : α) : x = x := by -- triv -- Let's extend `triv`.

source: variable (p q r : Prop) -- commutativity of ∧ and ∨ example : p ∧ q ↔ q ∧ p := sorry example : p ∨ q ↔ q ∨ p := sorry -- associativity of ∧ and ∨ example : (p ∧ q) ∧ r ↔ p ∧ (q ∧ r) := sorry example : (p ∨ q) ∨ r ↔ p ∨ (q ∨ r) := sorry -- distributivity example : p ∧ (q ∨ r) ↔ (p ∧ q) ∨ (p ∧ r) := sorry example : p ∨ (q ∧ r) ↔ (p ∨ q) ∧ (p ∨ r) := sorry -- other properties example : (p → (q → r)) ↔ (p ∧ q → r) := sorry example : ((p ∨ q) → r) ↔ (p → r) ∧ (q → r) := sorry example : ¬(p ∨ q) ↔ ¬p ∧ ¬q := sorry example : ¬p ∨ ¬q → ¬(p ∧ q) := sorry example : ¬(p ∧ ¬p) := sorry example : p ∧ ¬q → ¬(p → q) := sorry example : ¬p → (p → q) := sorry example : (¬p ∨ q) → (p → q) := sorry example : p ∨ False ↔ p := sorry example : p ∧ False ↔ False := sorry example : (p → q) → (¬q → ¬p) := sorry
ko: variable (p q r : Prop) -- ∧과 ∨의 교환성 example : p ∧ q ↔ q ∧ p := sorry example : p ∨ q ↔ q ∨ p := sorry -- ∧과 ∨의 결합성 example : (p ∧ q) ∧ r ↔ p ∧ (q ∧ r) := sorry example : (p ∨ q) ∨ r ↔ p ∨ (q ∨ r) := sorry -- 분배성 example : p ∧ (q ∨ r) ↔ (p ∧ q) ∨ (p ∧ r) := sorry example : p ∨ (q ∧ r) ↔ (p ∨ q) ∧ (p ∨ r) := sorry -- 다른 성질들 example : (p → (q → r)) ↔ (p ∧ q → r) := sorry example : ((p ∨ q) → r) ↔ (p → r) ∧ (q → r) := sorry example : ¬(p ∨ q) ↔ ¬p ∧ ¬q := sorry example : ¬p ∨ ¬q → ¬(p ∧ q) := sorry example : ¬(p ∧ ¬p) := sorry example : p ∧ ¬q → ¬(p → q) := sorry example : ¬p → (p → q) := sorry example : (¬p ∨ q) → (p → q) := sorry example : p ∨ False ↔ p := sorry example : p ∧ False ↔ False := sorry example : (p → q) → (¬q → ¬p) := sorry

source: well-founded recursive definitions
ko: 잘 세워진 재귀적 정의

source: where a is a sequence of data type parameters, b is the sequence of arguments to the constructors, and p[a, b] are the indices, which determine which element of the inductive family the construction inhabits.
ko: 여기서 a는 데이터 유형 매개변수의 나열이고 b는 생성자에 대한 인수의 나열이고 p[a, b] 는 귀납군의 어떤 원소가 생성자를 어디에 머무르게 할지 결정하는 색인입니다.

source: where intro x is the navigation command entering inside the fun binder.
ko: 여기서 intro x는 fun 결합자 내부로 들어가는 탐색 명령입니다.

source: where the precedences do not sufficiently determine associativity, Lean's parser will default to right associativity.
ko: 여기서 우선순위는 결합성을 결정하기에 충분하지 않아서 린의 구문분석기는 오른쪽 결합성으로 기본설정을 할 것입니다.

source: where the square brackets indicate that the argument of type Add a is instance implicit, i.e. that it should be synthesized using typeclass resolution.
ko: 여기서 대괄호는 Add a의 유형이 instance implicit임을 가리킵니다. 즉, 이것은 유형클래스 해결책을 사용해 합성되어야 합니다.

source: which is just syntax sugar for
ko: 이것은 다음에 대한 문법적 설탕입니다.

source: you find the following:
ko: 여러분은 다음을 발견합니다.

source: | _ => 0 -- Try it out.
ko: | _ => 0 -- 시도해 보세요.
